nxp-appcodehub/dm-mcxw71-accel-and-light-ble/source/wireless_uart.c
    }
    else if( (streamLength == COMMAND_LEN) ||  ( (streamLength == COMMAND_LEN + 1U) && ( *(pStream + 6) == '\n' )) )
    {
    	if(pCommand != NULL)
    	{
    		FLib_MemCpy(pCommand, pStream, COMMAND_LEN);
    	}
    	validCommand = TRUE;
    	*(pCommand+6) = '\0';
    }


    if(validCommand)
    {
    	validCommand = FALSE;
    	Str_UperCaseFormat(pCommand);
    	if( FLib_MemCmp(pCommand, c_command_msgs[0], COMMAND_LEN - 1U) || FLib_MemCmp(pCommand, c_command_msgs[1], COMMAND_LEN - 1U) )
    	{
    		validCommand = TRUE;

    		/* Check for Sensor type */
    		next_state = ( *(pCommand+5) == 'A' ) ? sm_measurement_accel : sm_measurement_light;
    	}
    }
    (void)MEM_BufferFree(pCommand);


    if(validCommand)
    {
    	SM_Sensor_Handler(next_state);
    }
    else
    {
    	if (mAppUartNewLine || (previousDeviceId != peerDeviceId))
    	{
    		streamLength += (uint16_t)sizeof(additionalInfoBuff);
    	}

    	/* Allocate buffer for asynchronous write */
    	pBuffer = MEM_BufferAlloc(streamLength);

    	if (pBuffer != NULL)
    	{
    		/* if this is a message from a previous device, print device ID */
    		if (mAppUartNewLine || (previousDeviceId != peerDeviceId))
    		{
    			messageHeaderSize = sizeof(additionalInfoBuff);

    			if (mAppUartNewLine)
    			{
    				mAppUartNewLine = FALSE;
    			}

    			additionalInfoBuff[3] = '0' + (peerDeviceId / 10U);
    			additionalInfoBuff[4] = '0' + (peerDeviceId % 10U);

    			if (gGapCentral_c != maPeerInformation[peerDeviceId].gapRole)
    			{
    				additionalInfoBuff[6] = 'P';
    			}

    			FLib_MemCpy(pBuffer, additionalInfoBuff, sizeof(additionalInfoBuff));
    		}

    		FLib_MemCpy(&pBuffer[messageHeaderSize], pStream, (uint32_t)streamLength - messageHeaderSize);
#if (defined(SERIAL_MANAGER_NON_BLOCKING_MODE) && (SERIAL_MANAGER_NON_BLOCKING_MODE > 0U))
    		serial_manager_status_t status = SerialManager_InstallTxCallback((serial_write_handle_t)s_writeHandle, Uart_TxCallBack, pBuffer);
    		(void)status;
    		assert(kStatus_SerialManager_Success == status);
    		if(SerialManager_WriteNonBlocking((serial_write_handle_t)s_writeHandle, pBuffer, streamLength) != kStatus_SerialManager_Success)
    		{
    			(void)MEM_BufferFree(pBuffer);
    		}
#else
    		(void)MEM_BufferFree(pBuffer);
#endif /*SERIAL_MANAGER_NON_BLOCKING_MODE > 0U*/
    	}

    	/* update the previous device ID */
    	previousDeviceId = peerDeviceId;

    }

}

/*! *********************************************************************************
 * \brief        Timer handler for flushing the UART.
 *
 * \param[in]    pData              Pointer to the parameters.
 ********************************************************************************** */
static void UartStreamFlushTimerCallback
(
    void *pData
)
{
    if (!mAppDapaPending)
    {
        mAppDapaPending = TRUE;
        (void)App_PostCallbackMessage(BleApp_FlushUartStream, NULL);
    }
}

/*! *********************************************************************************
* \brief        Handles UART Receive callback.
*
* \param[in]    pData        Unused pointer to data.
* \param[in]    pMessage     Unused pointer to message.
* \param[in]    status       Unused status.
********************************************************************************** */
static void Uart_RxCallBack
(
    void *pData,
    serial_manager_callback_message_t *pMessage,
    serial_manager_status_t status
)
{
    uint16_t byteCount = 0;

    if (byteCount < mAppUartBufferSize)
    {
        /* Restart flush timer */
        (void)TM_InstallCallback((timer_handle_t)mUartStreamFlushTimerId, UartStreamFlushTimerCallback, NULL);
        (void)TM_Start((timer_handle_t)mUartStreamFlushTimerId,
                    (uint8_t)kTimerModeLowPowerTimer | (uint8_t)kTimerModeSingleShot, mAppUartFlushIntervalInMs_c);
    }
    else
    {
        /* Post App Msg only one at a time */
        if (!mAppDapaPending)
        {
            mAppDapaPending = TRUE;
            (void)App_PostCallbackMessage(BleApp_FlushUartStream, NULL);
        }
    }
}

/*! *********************************************************************************
* \brief        Handles UART Transmit callback.
*
* \param[in]    pBuffer      Pointer to the sent data.
* \param[in]    pMessage     Unused pointer to message.
* \param[in]    status       Unused status.
********************************************************************************** */
static void Uart_TxCallBack
(
    void *pBuffer,
    serial_manager_callback_message_t *pMessage,
    serial_manager_status_t status
)
{
    (void)MEM_BufferFree(pMessage->buffer);
}


/*! *********************************************************************************
* \brief        Handles battery measurement timer callback.
*
* \param[in]    pParam        Callback parameters.
********************************************************************************** */
static void BatteryMeasurementTimerCallback
(
    void *pParam
)
{
    mBasServiceConfig.batteryLevel = SENSORS_GetBatteryLevel();
    (void)Bas_RecordBatteryMeasurement(&mBasServiceConfig);
}

static void AccelMeasurementTimerCallback
(
    void *pParam
)
{
	int32_t status;
		uint8_t* str;
		uint8_t* pMsg = NULL;
	    uint8_t  mPeerId = 0;
	    bool_t   mValidDevices = FALSE;
		uint8_t raw_data[FXLS8974_DATA_SIZE] = {0};
		fxls8974_acceldata_t accelData;
		uint8_t len;


	    /* Valid devices are in Running state */
	    for (mPeerId = 0; mPeerId < (uint8_t)gAppMaxConnections_c; mPeerId++)
	    {
	        if ((gInvalidDeviceId_c != maPeerInformation[mPeerId].deviceId) &&
	            (mAppRunning_c == maPeerInformation[mPeerId].appState))
	        {
	            mValidDevices = TRUE;
	            break;
	        }
	    }


	    if (mValidDevices)
	    {

	    	if(!mAppDapaPending)
	    	{
	    		/* Allocate buffer for GATT Write */
				pMsg = (uint8_t*)MEM_BufferAlloc(SizeOfString(s_accel_msg));
	    	}

	        if (pMsg != NULL)
	        {
	        	mAppDapaPending = TRUE;

