nxp-appcodehub/dm-mcxw71-accel-and-light-ble/source/wireless_uart.c
	        	status = FXLS8974_I2C_ReadData(&fxls8974Driver, FXLS8974_ACCEL_REGS_READ, raw_data);
	        	assert(ARM_DRIVER_OK == status);

	        	/*! Convert the raw sensor data to signed 16-bit container. */
	        	accelData.accel[0] = (int16_t)(((int16_t)(((int16_t)raw_data[1] << 8) | raw_data[0])));
	        	accelData.accel[1] = (int16_t)(((int16_t)(((int16_t)raw_data[3] << 8) | raw_data[2])));
	        	accelData.accel[2] = (int16_t)(((int16_t)(((int16_t)raw_data[5] << 8) | raw_data[4])));


	        	FLib_MemCpy(pMsg, (const void*)s_accel_msg, sizeof(s_accel_msg));

	        	for(uint8_t i = 0; i < 3; i++)
	        	{
	        		str = FORMAT_Dec2Str(abs(accelData.accel[i]));
	        		len = FLib_StrLen((char const *)str);

	        		if(accelData.accel[i] < 0)
	        		{
	        			pMsg[s_msg_offset[i]] = '-';
	        		}
	        		else
	        		{
	        			pMsg[s_msg_offset[i]] = ' ';
	        		}

	        		FLib_MemCpy((void*)&pMsg[s_msg_offset[i]+1], (const void*)str, len);

	        		accelData.accel[i] = (accelData.accel[i] < 0) ? accelData.accel[i]*-1:accelData.accel[i];
	        		accelData.accel[i] = (int16_t)(((int32_t)accelData.accel[i]*100U)/SCALE_MEASUREMENT_RANGE);
	        		if(accelData.accel[i] > 100U )
	        			accelData.accel[i] = 100U;

	        		HAL_PwmUpdateDutycycle(halPwmHandle_rgb, i, kHAL_EdgeAlignedPwm, accelData.accel[i]);
	        	}


	        	Serial_Print((uint8_t*)pMsg, gAllowToBlock_d);

	        	/* Send data over the air */
	        	BleApp_SendUartStream(pMsg, (uint8_t)SizeOfString(s_accel_msg));

	            /* Free Buffer */
	            (void)MEM_BufferFree(pMsg);

	            mAppDapaPending = FALSE;
	        }

	    }


}

void DEMO_LPADC_IRQ_HANDLER_FUNC(void)
{
	uint8_t* str;
	uint8_t* pMsg = NULL;
	uint8_t len;
	uint8_t  mPeerId = 0;
	uint8_t index = 0;
	bool_t   mValidDevices = FALSE;
	uint32_t average_conversion = 0;


	do{
		if (LPADC_GetConvResult(DEMO_LPADC_BASE, &g_LpadcResultConfigStruct, 0U))
		{
			// 16 bits result
			average_conversion += g_LpadcResultConfigStruct.convValue;
			index++;
		}
	}while(index <= FIFO_WATHER_MARK);

	down_sampling_cnt--;

 	if((msmt_state == sm_measurement_light) && (index > 0) && (down_sampling_cnt == 0))
	{

		/* Valid devices are in Running state */
		for (mPeerId = 0; mPeerId < (uint8_t)gAppMaxConnections_c; mPeerId++)
		{
			if ((gInvalidDeviceId_c != maPeerInformation[mPeerId].deviceId) &&
					(mAppRunning_c == maPeerInformation[mPeerId].appState))
			{
				mValidDevices = TRUE;
				break;
			}
		}


		if (mValidDevices)
		{

			if(!mAppDapaPending)
			{
				/* Allocate buffer for GATT Write */
				pMsg = (uint8_t*)MEM_BufferAlloc(SizeOfString(s_light_msg));
			}

			if (pMsg != NULL)
			{
				average_conversion /= FIFO_WATHER_MARK + 1U;
				average_conversion = (int32_t)(((float)average_conversion/g_LpadcFullRange)*100.0);

				str = FORMAT_Dec2Str(average_conversion);
				len = FLib_StrLen((char const *)str);

				FLib_MemCpy((void*)pMsg, (void*)s_light_msg, SizeOfString(s_light_msg) );
				FLib_MemCpy((void*)&pMsg[s_light_msg_offset], (const void*)str, len);

				Serial_Print((uint8_t*)pMsg, gAllowToBlock_d);

				/* Send data over the air */
				BleApp_SendUartStream(pMsg, (uint8_t)SizeOfString(s_light_msg));
				/* Free Buffer */
				(void)MEM_BufferFree(pMsg);

				mAppDapaPending = FALSE;
			}
		}

		down_sampling_cnt = LIGHT_SENSOR_DISP_DS;

	}

	SDK_ISR_EXIT_BARRIER;
}

static void SM_Sensor_Handler(sm_measurement_t next_state)
{

	switch (next_state)
	{
	case sm_measurement_off:

		if( TM_IsTimerActive(mAccelMeasurementTimerId))
		{
			TM_Stop((timer_handle_t)mAccelMeasurementTimerId);
		}
		HAL_PwmUpdateDutycycle(halPwmHandle_rgb, 0, kHAL_EdgeAlignedPwm, 0);
		HAL_PwmUpdateDutycycle(halPwmHandle_rgb, 1, kHAL_EdgeAlignedPwm, 0);
		HAL_PwmUpdateDutycycle(halPwmHandle_rgb, 2, kHAL_EdgeAlignedPwm, 0);

		break;
	case sm_measurement_accel:

		(void)TM_Start((timer_handle_t)mAccelMeasurementTimerId,
				(uint8_t)kTimerModeLowPowerTimer | (uint8_t)kTimerModeSetMicrosTimer, mAccelReportInterval_c);
		break;

	case sm_measurement_light:

		if( TM_IsTimerActive(mAccelMeasurementTimerId))
		{
			TM_Stop((timer_handle_t)mAccelMeasurementTimerId);
		}
		HAL_PwmUpdateDutycycle(halPwmHandle_rgb, 0, kHAL_EdgeAlignedPwm, 0);
		HAL_PwmUpdateDutycycle(halPwmHandle_rgb, 1, kHAL_EdgeAlignedPwm, 0);
		HAL_PwmUpdateDutycycle(halPwmHandle_rgb, 2, kHAL_EdgeAlignedPwm, 0);

		break;
	default:
		break;
	}

	msmt_state = next_state;
}

void Str_UperCaseFormat(uint8_t* ptr)
{
	while(*ptr != '\0')
	{
		if(IS_LOWER_CASE(ptr))
			UPER_CASE(ptr);
		ptr++;
	}
}


#if defined(gUseControllerNotifications_c) && (gUseControllerNotifications_c)
/*! *********************************************************************************
 * \brief        Function handling the Bluetooth Controller notification events.
 *
 * \param[in]    pNotificationEvent Pointer to the notification event.
 ********************************************************************************** */
static void BleApp_HandleControllerNotification
(
    bleNotificationEvent_t *pNotificationEvent
)
{
    switch(pNotificationEvent->eventType)
    {
        case (uint16_t)gNotifEventNone_c:
        {
            Serial_Print("Configured notification status ", gAllowToBlock_d);
            Serial_PrintDec((uint32_t)pNotificationEvent->status);
            Serial_Print("\n\r", gAllowToBlock_d);
            break;
        }

        case (uint16_t)gNotifConnEventOver_c:
        {
            Serial_Print("CONN Event Over device ", gAllowToBlock_d);
            Serial_PrintDec(pNotificationEvent->deviceId);
            Serial_Print(" on channel ", gAllowToBlock_d);
            Serial_PrintDec(pNotificationEvent->channel);
            Serial_Print(" with RSSI ", gAllowToBlock_d);
            Serial_PrintDec((uint8_t)pNotificationEvent->rssi);
            Serial_Print(" and event counter ", gAllowToBlock_d);
            Serial_PrintDec((uint16_t)pNotificationEvent->ce_counter);
            Serial_Print("\n\r", gAllowToBlock_d);
            break;
        }

        case (uint16_t)gNotifConnRxPdu_c:
        {
            Serial_Print("CONN Rx PDU from device ", gAllowToBlock_d);
            Serial_PrintDec(pNotificationEvent->deviceId);
            Serial_Print(" on channel ", gAllowToBlock_d);
            Serial_PrintDec(pNotificationEvent->channel);
            Serial_Print(" with RSSI ", gAllowToBlock_d);
            Serial_PrintDec((uint8_t)pNotificationEvent->rssi);
            Serial_Print(" with event counter ", gAllowToBlock_d);
            Serial_PrintDec((uint16_t)pNotificationEvent->ce_counter);
            Serial_Print(" and timestamp ", gAllowToBlock_d);
            Serial_PrintDec(pNotificationEvent->timestamp);
            Serial_Print("\n\r", gAllowToBlock_d);
            break;
        }

        case (uint16_t)gNotifAdvEventOver_c:
        {
            Serial_Print("ADV Event Over.\n\r", gAllowToBlock_d);
            break;
        }

        case (uint16_t)gNotifAdvTx_c:
        {
            Serial_Print("ADV Tx on channel ", gAllowToBlock_d);
            Serial_PrintDec(pNotificationEvent->channel);
            Serial_Print("\n\r", gAllowToBlock_d);
            break;
        }

        case (uint16_t)gNotifAdvScanReqRx_c:
        {
            Serial_Print("ADV Rx Scan Req on channel ", gAllowToBlock_d);
            Serial_PrintDec(pNotificationEvent->channel);
            Serial_Print(" with RSSI ", gAllowToBlock_d);
            Serial_PrintDec((uint8_t)pNotificationEvent->rssi);
            Serial_Print("\n\r", gAllowToBlock_d);
            break;
        }

        case (uint16_t)gNotifAdvConnReqRx_c:
        {
            Serial_Print("ADV Rx Conn Req on channel ", gAllowToBlock_d);
            Serial_PrintDec(pNotificationEvent->channel);
            Serial_Print(" with RSSI ", gAllowToBlock_d);
            Serial_PrintDec((uint8_t)pNotificationEvent->rssi);
            Serial_Print("\n\r", gAllowToBlock_d);
            break;
        }

        case (uint16_t)gNotifScanEventOver_c:
        {
            Serial_Print("SCAN Event Over on channel ", gAllowToBlock_d);
            Serial_PrintDec(pNotificationEvent->channel);
            Serial_Print("\n\r", gAllowToBlock_d);
            break;
        }

        case (uint16_t)gNotifScanAdvPktRx_c:
        {
            Serial_Print("SCAN Rx Adv Pkt on channel ", gAllowToBlock_d);
            Serial_PrintDec(pNotificationEvent->channel);
            Serial_Print(" with RSSI ", gAllowToBlock_d);
            Serial_PrintDec((uint8_t)pNotificationEvent->rssi);
            Serial_Print("\n\r", gAllowToBlock_d);
            break;
        }

        case (uint16_t)gNotifScanRspRx_c:
        {
            Serial_Print("SCAN Rx Scan Rsp on channel ", gAllowToBlock_d);
            Serial_PrintDec(pNotificationEvent->channel);
            Serial_Print(" with RSSI ", gAllowToBlock_d);
            Serial_PrintDec((uint8_t)pNotificationEvent->rssi);
            Serial_Print("\n\r", gAllowToBlock_d);
            break;
        }

        case (uint16_t)gNotifScanReqTx_c:
        {
            Serial_Print("SCAN Tx Scan Req on channel ", gAllowToBlock_d);
            Serial_PrintDec(pNotificationEvent->channel);
            Serial_Print("\n\r", gAllowToBlock_d);
            break;
        }

