nxp-appcodehub/dm-mcxw71-accel-and-light-ble/source/wireless_uart.c
        case (uint16_t)gNotifConnCreated_c:
        {
            Serial_Print("CONN Created with device ", gAllowToBlock_d);
            Serial_PrintDec(pNotificationEvent->deviceId);
            Serial_Print(" with timestamp ", gAllowToBlock_d);
            Serial_PrintDec(pNotificationEvent->timestamp);
            Serial_Print("\n\r", gAllowToBlock_d);
            break;
        }
        
        case (uint16_t)gNotifConnChannelMapUpdate_c:
        {
            Serial_Print("Map update with device ", gAllowToBlock_d);
            Serial_PrintDec(pNotificationEvent->deviceId);
            Serial_Print("\n\r", gAllowToBlock_d);
            break;
        }

        default:
        {
            ; /* No action required */
            break;
        }
    }
}

#if defined(gUseControllerNotificationsCallback_c) && (gUseControllerNotificationsCallback_c)
/*! *********************************************************************************
 * \brief        Function handling the controller notifications.
 *
 * \param[in]    pNotificationEvent Pointer to the notification event.
 ********************************************************************************** */
static void BleApp_ControllerNotificationCallback
(
    bleCtrlNotificationEvent_t *pNotificationEvent
)
{
    switch(pNotificationEvent->event_type)
    {
        case gNotifConnEventOver_c:
        {
            Serial_Print("CONN Ev Over\n\r", gNoBlock_d);
            break;
        }

        case gNotifConnRxPdu_c:
        {
            Serial_Print("CONN Rx PDU\n\r", gNoBlock_d);
            break;
        }

        case gNotifAdvEventOver_c:
        {
            Serial_Print("ADV Ev Over\n\r", gNoBlock_d);
            break;
        }

        case gNotifAdvTx_c:
        {
            Serial_Print("ADV Tx\n\r", gNoBlock_d);
            break;
        }

        case gNotifAdvScanReqRx_c:
        {
            Serial_Print("ADV Rx Scan Req\n\r", gNoBlock_d);
            break;
        }

        case gNotifAdvConnReqRx_c:
        {
            Serial_Print("ADV Rx Conn Req\n\r", gNoBlock_d);
            break;
        }

        case gNotifScanEventOver_c:
        {
            Serial_Print("SCAN Ev Over\n\r", gNoBlock_d);
            break;
        }

        case gNotifScanAdvPktRx_c:
        {
            Serial_Print("SCAN Rx Adv\n\r", gNoBlock_d);
            break;
        }

        case gNotifScanRspRx_c:
        {
            Serial_Print("SCAN Rx Scan Rsp\n\r", gNoBlock_d);
            break;
        }

        case gNotifScanReqTx_c:
        {
            Serial_Print("SCAN Tx Scan Req\n\r", gNoBlock_d);
            break;
        }

        case gNotifConnCreated_c:
        {
            Serial_Print("CONN Created\n\r", gNoBlock_d);
            break;
        }

        default:
        {
            ; /* No action required */
            break;
        }
    }
}
#endif

#endif

/*! *********************************************************************************
 * \brief        Function used to setup the serial interface.
 *
 ********************************************************************************** */
static void BleApp_SerialInit(void)
{
    serial_manager_status_t status;
    /*wireless uart serial manager handle*/
    static serial_handle_t appSerMgrIf;

    /* UI */
    appSerMgrIf = (serial_handle_t)&gSerMgrIf[0];

    /*open wireless uart read/write handle*/
    status = SerialManager_OpenWriteHandle((serial_handle_t)appSerMgrIf, (serial_write_handle_t)s_writeHandle);
    assert(kStatus_SerialManager_Success == status);
    (void)status;

    status = SerialManager_OpenReadHandle((serial_handle_t)appSerMgrIf, (serial_read_handle_t)s_readHandle);
    assert(kStatus_SerialManager_Success == status);
    status = SerialManager_InstallRxCallback((serial_read_handle_t)s_readHandle, Uart_RxCallBack, NULL);
    assert(kStatus_SerialManager_Success == status);
}


static void BleApp_AccelInit(void)
{


	int32_t status;
	uint8_t whoami = 0;
	ARM_DRIVER_I2C *I2Cdrv = &I2C_S_DRIVER; // Now using the shield.h value!!!
	hal_pwm_setup_config_t setupConfig = {
			.level = kHAL_PwmLowTrue,
			.mode = kHAL_EdgeAlignedPwm,
			.pwmFreq_Hz = 1000U,
			.dutyCyclePercent = 0U
	};
	BOARD_InitPinLED2();
	BOARD_InitPinLED3();
	BOARD_InitPinLED4();

	/*! Initialize the I2C driver. */
	status = I2Cdrv->Initialize(I2C_S_SIGNAL_EVENT);
	assert(ARM_DRIVER_OK == status);

	/*! Set the I2C Power mode. */
	status = I2Cdrv->PowerControl(ARM_POWER_FULL);
	assert(ARM_DRIVER_OK == status);

	/*! Set the I2C bus speed. */
	status = I2Cdrv->Control(ARM_I2C_BUS_SPEED, ARM_I2C_BUS_SPEED_FAST);
	assert(ARM_DRIVER_OK == status);

	/*! Initialize FXLS8974 sensor driver. */
	status = FXLS8974_I2C_Initialize(&fxls8974Driver, &I2C_S_DRIVER, I2C_S_DEVICE_INDEX, FXLS8974_I2C_ADDR,
			&whoami);
	assert(SENSOR_ERROR_NONE == status);

	/*! Configure the FXLS8974 sensor. */
	status = FXLS8974_I2C_Configure(&fxls8974Driver, cFxls8974ConfigNormal);
	assert(SENSOR_ERROR_NONE == status);

	CLOCK_SetIpSrc(kCLOCK_Tpm0, kCLOCK_IpSrcFro6M);
	HAL_PwmInit(halPwmHandle_rgb, 0U, 6000000U);
	HAL_PwmSetupPwm(halPwmHandle_rgb, 0U, &setupConfig);
	HAL_PwmSetupPwm(halPwmHandle_rgb, 1U, &setupConfig);
	HAL_PwmSetupPwm(halPwmHandle_rgb, 2U, &setupConfig);



}

static void BleApp_LighSensorInit(void)
{
	/* ------------------- LPIT ------------------- */
	/* -------------------------------------------- */
	/* -------------------------------------------- */

	/* Structure of initialize LPIT */
	lpit_config_t lpitConfig;
	lpit_chnl_params_t lpitChannelConfig;
	/* Set the source for the LPIT module */
	CLOCK_SetIpSrc(kCLOCK_Lpit0, kCLOCK_IpSrcFro6M);

	LPIT_GetDefaultConfig(&lpitConfig);
	lpitConfig.enableRunInDoze = true;

	/* Init lpit module */
	LPIT_Init(DEMO_LPIT_BASE, &lpitConfig);

	lpitChannelConfig.chainChannel          = false;
	lpitChannelConfig.enableReloadOnTrigger = false;
	lpitChannelConfig.enableStartOnTrigger  = false;
	lpitChannelConfig.enableStopOnTimeout   = false;
	lpitChannelConfig.timerMode             = kLPIT_PeriodicCounter;
	/* Set default values for the trigger source */
	lpitChannelConfig.triggerSelect = kLPIT_Trigger_TimerChn0;
	lpitChannelConfig.triggerSource = kLPIT_TriggerSource_External;

	/* Init lpit channel 0 */
	LPIT_SetupChannel(DEMO_LPIT_BASE, kLPIT_Chnl_0, &lpitChannelConfig);

